 #Использовать ".."

Парсер = Новый ПарсерСпискаБаз;
Парсер.УстановитьФайл();

Чистильщик = Новый ОчисткаКеша();
Чистильщик.УстановитьПарсер(Парсер);

// Очистить кеш конкретной базы
Прм = Новый Структура;
Прм.Вставить("Путь","""" + Чистильщик.ПутьСоОбратнымСлешем("C:\work\db\FinDB")+ """");
Результат = Чистильщик.ОчиститьКешБазы(Прм);
Если Результат = Истина Тогда
    Сообщить("Очищен кеш: " + Прм.Путь);
Иначе
    Сообщить("Возникли проблемы при очистке кеша: " + Прм.Путь);
КонецЕсли;

// Очистить весь кеш
Чистильщик.ОчиститьВесьКеш();
