#Использовать ".."

Перем юТест;

Процедура Инициализация()
	

КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	юТест = Тестирование;
	
	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_НайтиБазуПоИмени");
	СписокТестов.Добавить("Тест_Должен_НеНайтиБазуПоИмени");

	СписокТестов.Добавить("Тест_Должен_НайтиБазуПоПутиФайловая");
	СписокТестов.Добавить("Тест_Должен_НайтиБазуПоПутиВеб");
	СписокТестов.Добавить("Тест_Должен_НайтиБазуПоПутиСервер");
		
	Возврат СписокТестов;
	
КонецФункции

Процедура Тест_Должен_НайтиБазуПоИмени() Экспорт
	
	Парсер = Новый ПарсерСпискаБаз;
	Парсер.УстановитьФайл("tests/ibases.v8i");

	Результат = Парсер.НайтиПоИмени("FinDB");

	юТест.ПроверитьНеРавенство(Результат, Неопределено, "Не найдена база по имени");
	
КонецПроцедуры

Процедура Тест_Должен_НеНайтиБазуПоИмени() Экспорт
	
	Парсер = Новый ПарсерСпискаБаз;
	Парсер.УстановитьФайл("tests/ibases.v8i");

	Результат = Парсер.НайтиПоИмени("FinDB-3");

	юТест.ПроверитьРавенство(Результат, Неопределено, "Найдена база по имени FinDB-3");
	
КонецПроцедуры

Процедура Тест_Должен_НайтиБазуПоПутиФайловая() Экспорт
	
	Парсер = Новый ПарсерСпискаБаз;
	Парсер.УстановитьФайл("tests/ibases.v8i");

	Результат = Парсер.НайтиПоПути("C:\work\db\FinDB");

	юТест.ПроверитьНеРавенство(Результат, Неопределено, "Найдена база по пути");
	
КонецПроцедуры

Процедура Тест_Должен_НайтиБазуПоПутиВеб() Экспорт
	
	Парсер = Новый ПарсерСпискаБаз;
	Парсер.УстановитьФайл("tests/ibases.v8i");

	Результат = Парсер.НайтиПоПути("http://localhost/lessons/");

	юТест.ПроверитьРавенство(Результат.Connect.String, "Connect=ws=""http://localhost/lessons/"";", "Найдена база по пути");
	
КонецПроцедуры

Процедура Тест_Должен_НайтиБазуПоПутиСервер() Экспорт
	
	Парсер = Новый ПарсерСпискаБаз;
	Парсер.УстановитьФайл("tests/ibases.v8i");

	Результат = Парсер.НайтиПоПути("localhost:mysrvdata");

	юТест.ПроверитьНеРавенство(Результат, Неопределено, "Найдена база по пути");
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////
// Инициализация

Инициализация();