 #Использовать ".."

Парсер = Новый parserV8i;

Чистильщик = Новый CashCleaner();
Чистильщик.УстановитьПарсер(Парсер);
Чистильщик.ОчиститьВесьКеш();

	// СИ = Новый СистемнаяИнформация;
	// Окружение = СИ.ПеременныеСреды();

	// ПутьКФайлуСпискаБаз = Окружение.Получить("USERPROFILE")+"\appdata\roaming\1c\1cestart\ibases.v8i";
    // Попытка
    //     СписокБаз = УправлениеСписком.ПолучитьСписокБаз(ПутьКФайлуСпискаБаз);    
    // Исключение
    //     Сообщить("Ошибка: " + ОписаниеОшибки());
    // КонецПопытки;
	

// Процедура Выполнить(Параметры)
// 	Если Параметры[0] = "all" Тогда
// 		ОчиститьВесьКеш();
// 	ИначеЕсли СокрЛП(Параметры[0]) = "P" Тогда
// 		Инфо = Новый Структура();
// 		ПутьКБазе = СокрЛП(Параметры[1]);
// 		ПутьКБазе = ПутьКБазе + ?(Прав(ПутьКБазе,1)="\","","\");
// 		Инфо.Вставить("Путь", """" + ПутьКБазе + """");
// 		Результат = ОчиститьКешБазы(Инфо);
// 		Если Результат = Истина Тогда
// 			Сообщить("Очищен кеш: " + Инфо.Путь);
// 		Иначе
// 			Сообщить("Возникли проблемы при очистке кеша: " + Инфо.Путь);
// 		КонецЕсли;
// 	КонецЕсли;
	
// КонецПроцедуры

// // УправлениеСписком = ЗагрузитьСценарий("parserV8i.os");
// УправлениеСписком =  Новый ПарсерСпискаБаз();


// // Выполнить(АргументыКоманднойСтроки);

//  МассивПарамеров = новый Массив;
// //  МассивПарамеров.Добавить("all");
//  МассивПарамеров.Добавить("P");
//  МассивПарамеров.Добавить("c:\work\db\v8_tasks");

//  Выполнить(МассивПарамеров);